templatedir/gross/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0.001;

boundaryField
{
    /*
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            calculated;
        value           uniform 0;
    }
    prismWall
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    defaultFaces
    {
        type            empty;
    }
    */
    
    minY
    {
        type            empty;
    }
    maxY
    {
        type            calculated;
        value           uniform 0;
    }
    theWalls
    {
        type            compressible::alphatWallFunction;
        value           $internalField;
    }
    minX
    {
        type            calculated;
        value           uniform 0;
    }
    maxX
    {
        type inletOutlet;
        inletValue uniform 0;
        value uniform 0;
    }
    minZ
    {
        type           wedge;//wedge;
    }
    maxZ
    {
        type           wedge;//wedge;
    }
    /*defaultFaces
    {
        type        empty;
    }*/
}


// ************************************************************************* //
