templatedir/gross/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

libs (
     // "libOpenFOAM.so"
      "libsimpleSwakFunctionObjects.so"
     // "libswakFunctionObjects.so"
      "libgroovyBC.so"
     // "libsampling.so"
     // "libswakCloudFunctionObjects.so"
     );
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//#include "meshvar"

application     rhoCentralFoam;//rhoPimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.0006;

deltaT          1e-9;

writeControl    adjustableRunTime;

writeInterval   0.0006;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable false;

adjustTimeStep  yes;

maxCo           1.6;
maxAlphaCo      1.5;


maxDeltaT       1e-07;

// ************************************************************************* //
